#include <stdio.h>

int main(){
    // (111260335 + 13) % 30 + 1 = 9
    int n, i, a; scanf("%d", &n);
    i = 0; a = 10; 
    while (i <= n){
        printf("%d ", a);
        a -= 1; i++;
    }
    printf("\n");
    /* постфиксный - возращает старое значение, затем его уменьшает/увеличивает
    префиксный - сначало уменьшает/увеличивает переменную, затем возращает ее значение
    в данной программе нет разницы какой инкремент использовать, т.к. переменная используется в качестве счетчика */
    return 0;
}