#include <stdio.h>

const int k = 1000;

int main(){
    // (111260335 + 23) % 30 + 1 = 19
    double mv, v;
    printf("mv = ");
    while (scanf("%lf", &mv) == 1){
        printf("v = %.2f\n", mv / k);
        printf("mv = ");
    }
    /* тип float имеет меньшую точность округления, чем double 
    в случае ввода несоответвующего значения, оно сохраняется в буфере ввода без возможности изменить,
    но используя условие в while, при некорректном значении просто завершаем программу */
    return 0;
}